---
kind: method
id: M:Autodesk.Revit.DB.Visual.AssetProperty.GetTypeName(Autodesk.Revit.DB.Visual.AssetPropertyType)
source: html/88de4671-37ce-e6c5-cb56-5a8758fee195.htm
---
# Autodesk.Revit.DB.Visual.AssetProperty.GetTypeName Method

Get the name of the AssetProperty

## Syntax (C#)
```csharp
public static string GetTypeName(
	AssetPropertyType type
)
```

## Parameters
- **type** (`Autodesk.Revit.DB.Visual.AssetPropertyType`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - Thrown when type is AssetPropertyType::Unknown.